archived_old_versions/gaganyaan_openfoam_staged_research_v2/gaganyaan_openfoam_staged_research_v2/cases/04_main_reef2/0/k
FoamFile
{ version 2.0; format ascii; class volScalarField; object k; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 6;
boundaryField
{
    inlet { type fixedValue; value uniform 6; }
    outlet { type zeroGradient; }
    farfield { type zeroGradient; }
    canopy { type kqRWallFunction; value uniform 6; }
    frontAndBack { type empty; }
}
