archived_old_versions/gaganyaan_openfoam_staged_research_v2/gaganyaan_openfoam_staged_research_v2/cases/04_main_reef2/0/omega
FoamFile
{ version 2.0; format ascii; class volScalarField; object omega; }
dimensions [0 0 -1 0 0 0 0];
internalField uniform 3.2991444;
boundaryField
{
    inlet { type fixedValue; value uniform 3.2991444; }
    outlet { type zeroGradient; }
    farfield { type zeroGradient; }
    canopy { type omegaWallFunction; value uniform 3.2991444; }
    frontAndBack { type empty; }
}
